{"START": 0, "END": 1, "UNK": 2, "PAD": 3, "The": 4, "Vaults": 5, "pub": 6, "near": 7, "Caf\u00c3": 8, "\u00a9": 9, "Adriatic": 10, "has": 11, "a": 12, "5": 13, "star": 14, "rating": 15, ".": 16, "Prices": 17, "start": 18, "at": 19, "\u00c2\u00a3": 20, "30": 21, "\n": 22, "Close": 23, "to": 24, "Brazil": 25, ",": 26, "Cambridge": 27, "Blue": 28, "serves": 29, "delicious": 30, "for": 31, "the": 32, "cheap": 33, "price": 34, "of": 35, "Pub": 36, "food": 37, "Eagle": 38, "is": 39, "low": 40, "rated": 41, "coffee": 42, "shop": 43, "Burger": 44, "King": 45, "and": 46, "riverside": 47, "that": 48, "family": 49, "friendly": 50, "less": 51, "than": 52, "20": 53, "Japanese": 54, "Located": 55, "Sorrento": 56, "French": 57, "eatery": 58, "called": 59, "Mill": 60, "with": 61, "range": 62, "20-": 63, "25": 64, "it": 65, "in": 66, "area": 67, "For": 68, "Loch": 69, "Fyne": 70, "located": 71, "by": 72, "river": 73, "next": 74, "Rice": 75, "Boat": 76, "Bibimbap": 77, "House": 78, "moderately": 79, "priced": 80, "restaurant": 81, "who": 82, "'s": 83, "cuisine": 84, "English": 85, "You": 86, "will": 87, "find": 88, "this": 89, "local": 90, "Clare": 91, "Hall": 92, "Riverside": 93, "an": 94, "adult": 95, "high": 96, "customer": 97, "Wrestlers": 98, "It": 99, "situated": 100, "Raja": 101, "Indian": 102, "Cuisine": 103, "are": 104, "not": 105, "-": 106, "In": 107, "city": 108, "centre": 109, "lies": 110, "Aromi": 111, "adults": 112, "Phoenix": 113, "fast": 114, "place": 115, "They": 116, "have": 117, "moderate": 118, "pricing": 119, "3": 120, "out": 121, "Browns": 122, "Fast": 123, "A": 124, "child": 125, "Taste": 126, "Friendly": 127, "Cocum": 128, "can": 129, "serve": 130, "you": 131, "Italian": 132, "affordable": 133, "prices": 134, "however": 135, "only": 136, "average": 137, "Dumpling": 138, "Tree": 139, "Punter": 140, "provides": 141, "Golden": 142, "Curry": 143, "breakfast": 144, "joint": 145, "Rouge": 146, "offers": 147, "one": 148, "five": 149, "Yippee": 150, "Noodle": 151, "Bar": 152, "Alimentum": 153, "euros": 154, "Chinese": 155, "though": 156, "poor": 157, "Portland": 158, "Arms": 159, "Their": 160, "they": 161, "An": 162, "its": 163, "more": 164, "Near": 165, "All": 166, "One": 167, "Midsummer": 168, "highly": 169, "customers": 170, "but": 171, "close": 172, "Express": 173, "Holiday": 174, "Inn": 175, "Spice": 176, "There": 177, "Strada": 178, "which": 179, "features": 180, "ratings": 181, "Waterman": 182, "serving": 183, "received": 184, "reviews": 185, "providing": 186, "dine": 187, "meals": 188, "named": 189, "Zizzi": 190, "kid": 191, "outside": 192, "City": 193, "Centre": 194, "Bakers": 195, "should": 196, "be": 197, "kids": 198, "Green": 199, "Man": 200, "costs": 201, "thirty": 202, "pounds": 203, "ranging": 204, "non": 205, "Sicilia": 206, "Clowns": 207, "Shop": 208, "fine": 209, "along": 210, "Avalon": 211, "quite": 212, "while": 213, "recommended": 214, "take": 215, "children": 216, "there": 217, "On": 218, "Giraffe": 219, "well": 220, "offering": 221, "higher": 222, "Olive": 223, "Grove": 224, "those": 225, "prepared": 226, "pay": 227, "over": 228, "Six": 229, "Bells": 230, "Twenty": 231, "Two": 232, "Ranch": 233, "Cricketers": 234, "good": 235, "Crowne": 236, "Plaza": 237, "Hotel": 238, "Wildwood": 239, "public": 240, "house": 241, "establishment": 242, "inexpensive": 243, "North": 244, "1": 245, "Rainbow": 246, "Vegetarian": 247, "center": 248, "Palace": 249, "given": 250, "on": 251, "fairly": 252, "excellent": 253, "costing": 254, "atmosphere": 255, "some": 256, "lovely": 257, "stars": 258, "no": 259, "please": 260, "was": 261, "rate": 262, "wine": 263, "cheese": 264, "Its": 265, "yet": 266, "families": 267, "site": 268, "eat": 269, "been": 270, "Children": 271, "served": 272, "Luton": 273, "budget": 274, "spirits": 275, "between": 276, "environment": 277, "With": 278, "as": 279, "traditional": 280, "Plough": 281, "services": 282, "isn": 283, "'": 284, "t": 285, "three": 286, "point": 287, "best": 288, "just": 289, "go": 290, "very": 291, "welcomes": 292, "expensive": 293, "Serving": 294, "Not": 295, "averagely": 296, "north": 297, "British": 298, "Families": 299, "welcome": 300, "Cotto": 301, "This": 302, "because": 303, "mid": 304, "fare": 305, "Customer": 306, "twenty": 307, "pound": 308, "up": 309, "road": 310, "from": 311, "cost": 312, "right": 313, "found": 314, "bar": 315, "conveniently": 316, "town": 317, "style": 318, "If": 319, "'re": 320, "looking": 321, "upscale": 322, "look": 323, "further": 324, "generally": 325, "oriented": 326, "great": 327, "store": 328, "At": 329, "grab": 330, "lunch": 331, "or": 332, "friends": 333, "fair": 334, "items": 335, "starting": 336, "also": 337, "boasts": 338, "being": 339, "allowed": 340, "Fitzbillies": 341, "ranged": 342, "satisfaction": 343, "Rating": 344, "While": 345, "nearby": 346, "hotel": 347, "part": 348, "chain": 349, "end": 350, "Moderately": 351, "standard": 352, "But": 353, "dishes": 354, "offer": 355, "Unfortunately": 356, "permitted": 357, "Travellers": 358, "Rest": 359, "Beefeater": 360, "outskirts": 361, "poorly": 362, "name": 363, "delivers": 364, "away": 365, "does": 366, "sells": 367, "No": 368, "deliveries": 369, "few": 370, "steps": 371, "Highly": 372, "variety": 373, "wines": 374, "cheeses": 375, "enjoy": 376, "sushi": 377, "options": 378, "venue": 379, "visit": 380, "within": 381, "Customers": 382, "reasonably": 383, "get": 384, "when": 385, "off": 386, "allow": 387, "review": 388, "location": 389, "Food": 390, "High": 391, "costumer": 392, "where": 393, "medium": 394, "burger": 395, "gourmet": 396, "Is": 397, "Offering": 398, "locate": 399, "'ll": 400, "whose": 401, "cater": 402, "drinks": 403, "selling": 404, "suitable": 405, "option": 406, "decent": 407, "eating": 408, "burgers": 409, "above": 410, "nice": 411, "try": 412, "Low": 413, "their": 414, "popular": 415, "too": 416, "When": 417, "dining": 418, "beside": 419, "around": 420, "Although": 421, "wide": 422, "fantastic": 423, "service": 424, "young": 425, "Rated": 426, "receives": 427, "edge": 428, "our": 429, "choice": 430, "drink": 431, "all": 432, "under": 433, "foods": 434, "view": 435, "age": 436, "groups": 437, "quality": 438, "quiet": 439, "Welcome": 440, "We": 441, "top": 442, "doesn": 443, "both": 444, "Average": 445, "Ratings": 446, "after": 447, "caters": 448, "lowly": 449, "Priced": 450, "L30": 451, "currently": 452, "pasta": 453, "reasonable": 454, "fresh": 455, "opened": 456, "rates": 457, "menu": 458, "By": 459, "bit": 460, "Kid": 461, "Crown": 462, "considered": 463, "lower": 464, "type": 465, "although": 466, "know": 467, "unfortunately": 468, "middle": 469, "Price": 470, "ranges": 471, "do": 472, "your": 473, "such": 474, "tasty": 475, "hamburgers": 476, "down": 477, "gets": 478, "Eat": 479, "sell": 480, "neat": 481, "welcoming": 482, "outstanding": 483, "love": 484, "somewhere": 485, "I": 486, "about": 487, "pricey": 488, "perfect": 489, "Range": 490, "Find": 491, "cheaply": 492, "terrible": 493, "Check": 494, "light": 495, "meal": 496, "far": 497, "selection": 498, "And": 499, "somewhat": 500, "awesome": 501, "fries": 502, "Along": 503, "so": 504, "specializes": 505, "yes": 506, "level": 507, "whole": 508, "provide": 509, "Looking": 510, "friend": 511, "side": 512, "River": 513, "sit": 514, "unfriendly": 515, "tasting": 516, "value": 517, "got": 518, "featuring": 519, "Adult": 520, "setting": 521, "sits": 522, "scores": 523, "Cheap": 524, "having": 525, "below": 526, "upper": 527, "Asian": 528, "beautiful": 529, "small": 530, "really": 531, "Serves": 532, "Please": 533, "servers": 534, "Yes": 535, "reduced": 536, "consumer": 537, "spot": 538, "American": 539, "dinner": 540, "names": 541, "expect": 542, "Child": 543, "Found": 544, "worth": 545, "Come": 546, "check": 547, "seeking": 548, "greater": 549, "us": 550, "centrally": 551, "most": 552, "stop": 553, "themed": 554, "going": 555, "costly": 556, "facility": 557, "dollars": 558, "bracket": 559, "starred": 560, "plates": 561, "quick": 562, "make": 563, "Join": 564, "available": 565, "However": 566, "want": 567, "..": 568, "Family": 569, "Expect": 570, "gave": 571, "relatively": 572, "loves": 573, "restaurants": 574, "inside": 575, "why": 576, "east": 577, "without": 578, "hors": 579, "d": 580, "due": 581, "Situated": 582, "As": 583, "if": 584, "little": 585, "better": 586, "rage": 587, "specializing": 588, "would": 589, "recommend": 590, "every": 591, "day": 592, "Also": 593, "4": 594, "we": 595, "s": 596, "welcomed": 597, "typical": 598, "heart": 599, "Euros": 600, ";": 601, "cheaper": 602, "mature": 603, "competitive": 604, "Enjoy": 605, "money": 606, "he": 607, "earned": 608, "other": 609, "snacks": 610, "allows": 611, "rank": 612, "new": 613, "views": 614, "come": 615, "typically": 616, "charges": 617, "superb": 618, "across": 619, "home": 620, "Visit": 621, "score": 622, "then": 623, "Meals": 624, "favorite": 625, "comes": 626, "bad": 627, "Our": 628, "none": 629, "give": 630, "towards": 631, "reviewed": 632, "known": 633, "includes": 634, "must": 635, "modest": 636, "Next": 637, "Has": 638, "ideal": 639, "had": 640, "won": 641, "recently": 642, "scored": 643, "ranked": 644, "falls": 645, "Expensive": 646, "Here": 647, "amazing": 648, "places": 649, "banks": 650, "Thames": 651, "seafood": 652, "Area": 653, "Kids": 654, "Start": 655, "provided": 656, "Just": 657, "i": 658, "chips": 659, "including": 660, "per": 661, "head": 662, "yourself": 663, "outlet": 664, "might": 665, "zone": 666, "spend": 667, "like": 668, "Though": 669, "Sushi": 670, "short": 671, "distance": 672, "highest": 673, "takeaway": 674, "experience": 675, "rice": 676, "previous": 677, "selections": 678, "premium": 679, "night": 680, "Go": 681, "Look": 682, "Don": 683, "based": 684, "Three": 685, "makes": 686, "usually": 687, "district": 688, "suited": 689, "L20": 690, "Moderate": 691, "were": 692, "despite": 693, "them": 694, "holds": 695, "proximity": 696, "leave": 697, "placed": 698, "overall": 699, "say": 700, "could": 701, "Down": 702, "licensed": 703, "Try": 704, "tag": 705, "catering": 706, "averaged": 707, "may": 708, ":": 709, "people": 710, "Adults": 711, "eats": 712, "euro": 713, "receiving": 714, "diner": 715, "mind": 716, "buy": 717, "Have": 718, "even": 719, "20.00": 720, "Despite": 721, "styled": 722, "pretty": 723, "offered": 724, "convenient": 725, "sure": 726, "spaghetti": 727, "south": 728, "grub": 729, "riverfront": 730, "taste": 731, "door": 732, "don": 733, "aren": 734, "shops": 735, "bring": 736, "open": 737, "ages": 738, "searching": 739, "wonderful": 740, "sited": 741, "ate": 742, "exclusive": 743, "note": 744, "always": 745, "call": 746, "bill": 747, "among": 748, "many": 749, "free": 750, "ship": 751, "Good": 752, "Leave": 753, "slightly": 754, "plus": 755, "class": 756, "fancy": 757, "fun": 758, "5of5": 759, "rather": 760, "aimed": 761, "authentic": 762, "alcohol": 763, "Wine": 764, "Cheese": 765, "rang": 766, "normal": 767, "here": 768, "what": 769, "Public": 770, "restrooms": 771, "full": 772, "something": 773, "server": 774, "Great": 775, "Conveniently": 776, "need": 777, "corner": 778, "scale": 779, "fruit": 780, "beverages": 781, "person": 782, "regarded": 783, "set": 784, "Locate": 785, "E20": 786, "averages": 787, "gives": 788, "Bring": 789, "bite": 790, "ok": 791, "margin": 792, "now": 793, "amenities": 794, "Even": 795, "clentele": 796, "Only": 797, "mediocre": 798, "averaging": 799, "GBP": 800, "alternative": 801, "much": 802, "Star": 803, "Right": 804, "deals": 805, "okay": 806, "aware": 807, "still": 808, "Mid": 809, "entire": 810, "everyone": 811, "order": 812, "list": 813, "College": 814, "oriental": 815, "classic": 816, "into": 817, "starts": 818, "see": 819, "bank": 820, "products": 821}